In [5]:
import pandas as pd 
import numpy as np 
import matplotlib.pyplot as plt
import seaborn as sns
import re 
import warnings
warnings.filterwarnings("ignore")

In [7]:
country = pd.read_csv("C:/project/IPL_2016/Country.csv")
country.head()

   Country_Id  Country_Name
0           1         India
1           2  South Africa
2           3         U.A.E
3           4   New Zealand
4           5     Australia

In [8]:
country.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 2 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Country_Id    12 non-null     int64
 1   Country_Name  12 non-null     object
dtypes: int64(1), object(1)
memory usage: 324.0+ bytes

In [9]:
country.duplicated().sum()

0

In [10]:
missing_values = country.isnull().sum()
missing_values

Country_Id      0
Country_Name    0
dtype: int64

In [11]:
extra_runs = pd.read_csv("C:/project/IPL_2016/Extra_Runs.csv")
extra_runs.head()

   Match_Id  Over_Id  Ball_Id  Extra_Type_Id  Extra_Runs  Innings_No
0    335987        1        1              1           1           1
1    335987        1        2              2           1           2
2    335987        1        3              2           1           1
3    335987        1        7              1           1           1
4    335987        2        3              1           4           2

In [12]:
extra_runs.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7469 entries, 0 to 7468
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Match_Id       7469 non-null   int64
 1   Over_Id        7469 non-null   int64
 2   Ball_Id        7469 non-null   int64
 3   Extra_Type_Id  7469 non-null   int64
 4   Extra_Runs     7469 non-null   int64
 5   Innings_No     7469 non-null   int64
dtypes: int64(6)
memory usage: 350.2 KB

In [13]:
extra_runs.duplicated().sum()

0

In [14]:
missing_values = extra_runs.isnull().sum()
missing_values

Match_Id         0
Over_Id          0
Ball_Id          0
Extra_Type_Id    0
Extra_Runs       0
Innings_No       0
dtype: int64

In [15]:
extra_type = pd.read_csv("C:/project/IPL_2016/Extra_Type.csv")
extra_type.head()

   Extra_Id Extra_Name
0         1    legbyes
1         2      wides
2         3       byes
3         4    noballs
4         5    penalty

In [16]:
extra_type.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Extra_Id    5 non-null      int64
 1   Extra_Name  5 non-null      object
dtypes: int64(1), object(1)
memory usage: 212.0+ bytes

In [17]:
extra_type.duplicated().sum()

0

In [19]:
missing_values = extra_type.isnull().sum()
missing_values

Extra_Id      0
Extra_Name    0
dtype: int64

In [20]:
ipl_match = pd.read_csv("C:/project/IPL_2016/Match.csv")
ipl_match

,Match_Id,Team_1,Team_2,Match_Date,Season_Id,Venue_Id,Toss_Winner,Toss_Decide,Win_Type,Win_Margin,Outcome_type,Match_Winner,Man_of_the_Match
0,335987,2,1,2008-04-18,1,1,2,1,1,140.0,1,1.0,2.0
1,335988,4,3,2008-04-19,1,2,3,2,1,33.0,1,3.0,19.0
2,335989,6,5,2008-04-19,1,3,5,2,2,9.0,1,6.0,90.0
3,335990,7,2,2008-04-20,1,4,7,2,2,5.0,1,2.0,11.0
4,335991,1,8,2008-04-20,1,5,8,2,2,5.0,1,1.0,4.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
572,981016,6,2,2016-05-22,9,27,2,1,2,6.0,1,2.0,8.0
573,981018,13,2,2016-05-24,9,1,2,1,2,4.0,1,2.0,110.0
574,981020,11,1,2016-05-25,9,3,1,1,1,22.0,1,11.0,163.0
575,981022,13,11,2016-05-27,9,3,11,1,2,4.0,1,11.0,187.0
576,981024,2,11,2016-05-29,9,1,11,2,1,8.0,1,11.0,385.0

In [21]:
ipl_match.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 577 entries, 0 to 576
Data columns (total 13 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Match_Id          577 non-null    int64
 1   Team_1            577 non-null    int64
 2   Team_2            577 non-null    int64
 3   Match_Date        577 non-null    object
 4   Season_Id         577 non-null    int64
 5   Venue_Id          577 non-null    int64
 6   Toss_Winner       577 non-null    int64
 7   Toss_Decide       577 non-null    int64
 8   Win_Type          577 non-null    int64
 9   Win_Margin        568 non-null    float64
 10  Outcome_type      577 non-null    int64
 11  Match_Winner      574 non-null    float64
 12  Man_of_the_Match  574 non-null    float64
dtypes: float64(3), int64(9), object(1)
memory usage: 58.7+ KB

In [22]:
ipl_match.duplicated().sum()

0

In [23]:
missing_values = ipl_match.isnull().sum()
missing_values

Match_Id            0
Team_1              0
Team_2              0
Match_Date          0
Season_Id           0
Venue_Id            0
Toss_Winner         0
Toss_Decide         0
Win_Type            0
Win_Margin          9
Outcome_type        0
Match_Winner        3
Man_of_the_Match    3
dtype: int64

In [25]:
ipl_match['Match_Date'].value_counts()

Match_Date
2011-04-17    2
2011-05-02    2
2011-05-05    2
2011-05-07    2
2011-05-08    2
             ..
2012-04-13    1
2012-04-14    1
2012-04-16    1
2012-04-18    1
2016-05-29    1
Name: count, Length: 407, dtype: int64

In [26]:
ipl_match['Match_Date'] = pd.to_datetime(ipl_match['Match_Date'], errors = 'coerce')

In [31]:
ipl_match.info()

<class 'pandas.core.frame.DataFrame'>
Index: 568 entries, 0 to 576
Data columns (total 13 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Match_Id          568 non-null    int64
 1   Team_1            568 non-null    int64
 2   Team_2            568 non-null    int64
 3   Match_Date        568 non-null    datetime64[ns]
 4   Season_Id         568 non-null    int64
 5   Venue_Id          568 non-null    int64
 6   Toss_Winner       568 non-null    int64
 7   Toss_Decide       568 non-null    int64
 8   Win_Type          568 non-null    int64
 9   Win_Margin        568 non-null    float64
 10  Outcome_type      568 non-null    int64
 11  Match_Winner      568 non-null    float64
 12  Man_of_the_Match  568 non-null    float64
dtypes: datetime64[ns](1), float64(3), int64(9)
memory usage: 62.1 KB

In [30]:
ipl_match.dropna(inplace = True)

In [32]:
out_type = pd.read_csv("C:/project/IPL_2016/Out_Type.csv")
out_type

   Out_Id               Out_Name
0       1                 caught
1       2                 bowled
2       3                run out
3       4                    lbw
4       5           retired hurt
5       6                stumped
6       7      caught and bowled
7       8             hit wicket
8       9  obstructing the field

In [33]:
out_type.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 2 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Out_Id    9 non-null      int64
 1   Out_Name  9 non-null      object
dtypes: int64(1), object(1)
memory usage: 276.0+ bytes

In [34]:
out_type.duplicated().sum()

0

In [35]:
missing_values = out_type.isnull().sum()
missing_values

Out_Id      0
Out_Name    0
dtype: int64

In [38]:
country.to_csv("ipl_country.csv", index = False)

In [42]:
extra_runs.to_csv("ipl_extra_runs.csv", index = False)

In [41]:
extra_type.to_csv("ipl_extra_type.csv", index = False)

In [43]:
ipl_match.to_csv("ipl_match.csv", index = False)

In [44]:
out_type.to_csv("ipl_out_type.csv", index = False)